balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1782.PIC
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APFCON" edc:desc="Alternate Pin Function Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APFCON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="APFCON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2SEL" edc:desc="" edc:mask="0x1" edc:name="CCP2SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXSEL" edc:desc="" edc:mask="0x1" edc:name="RXSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXSEL" edc:desc="" edc:mask="0x1" edc:name="TXSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDISEL" edc:desc="" edc:mask="0x1" edc:name="SDISEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCKSEL" edc:desc="" edc:mask="0x1" edc:name="SCKSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDOSEL" edc:desc="" edc:mask="0x1" edc:name="SDOSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1SEL" edc:desc="" edc:mask="0x1" edc:name="CCP1SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OUTSEL" edc:desc="" edc:mask="0x1" edc:name="C2OUTSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CM3CON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000x100" edc:name="CM3CON0" edc:nzwidth="8" edc:por="0000x100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C3SYNC" edc:desc="" edc:mask="0x1" edc:name="C3SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3HYS" edc:desc="" edc:mask="0x1" edc:name="C3HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3SP" edc:desc="" edc:mask="0x1" edc:name="C3SP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3ZLF" edc:desc="" edc:mask="0x1" edc:name="C3ZLF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3POL" edc:desc="" edc:mask="0x1" edc:name="C3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3OE" edc:desc="" edc:mask="0x1" edc:name="C3OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3OUT" edc:desc="" edc:mask="0x1" edc:name="C3OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3ON" edc:desc="" edc:mask="0x1" edc:name="C3ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CM3CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CM3CON1" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C3NCH0" edc:desc="" edc:mask="0x1" edc:name="C3NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3NCH1" edc:desc="" edc:mask="0x1" edc:name="C3NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3NCH2" edc:desc="" edc:mask="0x1" edc:name="C3NCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH0" edc:desc="" edc:mask="0x1" edc:name="C3PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH1" edc:desc="" edc:mask="0x1" edc:name="C3PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3PCH2" edc:desc="" edc:mask="0x1" edc:name="C3PCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3INTN" edc:desc="" edc:mask="0x1" edc:name="C3INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3INTP" edc:desc="" edc:mask="0x1" edc:name="C3INTP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C3NCH" edc:desc="" edc:mask="0x7" edc:name="C3NCH" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="C3PCH" edc:desc="" edc:mask="0x7" edc:name="C3PCH" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="ANSELA" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-111111" edc:name="ANSELA" edc:nzwidth="0x8" edc:por="1-111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA3" edc:desc="" edc:mask="0x1" edc:name="ANSA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA5" edc:desc="" edc:mask="0x1" edc:name="ANSA5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSA7" edc:desc="" edc:mask="0x1" edc:name="ANSA7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELA" edc:desc="" edc:mask="0xff" edc:name="ANSELA" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ANSELB" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="ANSELB" edc:nzwidth="8" edc:por="--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSB0" edc:desc="" edc:mask="0x1" edc:name="ANSB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB1" edc:desc="" edc:mask="0x1" edc:name="ANSB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB2" edc:desc="" edc:mask="0x1" edc:name="ANSB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB3" edc:desc="" edc:mask="0x1" edc:name="ANSB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB4" edc:desc="" edc:mask="0x1" edc:name="ANSB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB5" edc:desc="" edc:mask="0x1" edc:name="ANSB5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELB" edc:desc="" edc:mask="0x3f" edc:name="ANSELB" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
